// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//     if(friends.length >= 3){
//         console.log('це великий масив, в якому  3 і більше елементи.')
//     }else console.log('це маленький масив, в якому менше 3-х елементів.')

/////////////////////////////////////////////////////////////////////////////
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let arr = [1,2,3]
// console.log(arr[1])//я не розумію умову задачі. якщо просто знайти середнє число з трьох то це логічно, що воно під індексом 1

////////////////////////////////////////////////////////////////////////////////////////
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let a= 3
// let b = 1
// result = (a + b) < 4 ? result = 'Мало' : result = 'Багато';
// console.log(result)


///////////////////////////////////////////////////////////////////////
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let num = Math.floor(Math.random() * (100 - -100) + -100)
//варіант 1
// num < 0 ? console.log(num, 'негативне') : console.log(num,'позитивне')
//варіант 2(закоментуйте попередній варіант)
// if(num < 0){
//     console.log(num, 'негативне')
// }else if (num > 0){
//     console.log(num,'позитивне')
// }else {
//     console.log(num,'нуль')
// }