// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// let result = 0
// for (let i = 0; i < arr.length; i++) {
//     result = result + arr[i]
// }
// console.log(result)

// Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// const book = {
//     'назва':'...',
//     'кількість сторінок':'...',
//     'жанр': '...',
//     'автори' : '...'
// }

// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
// const book = [
//     {
//         'назва': '...',
//         'кількість сторінок': '...',
//         'жанр': '...',
//         'автори': '...'
//     },
//     {
//         'назва': '...',
//         'кількість сторінок': '...',
//         'жанр': '...',
//         'автори': '...'
//     },
//     {
//         'назва': '...',
//         'кількість сторінок': '...',
//         'жанр': '...',
//         'автори': '...'
//     }
// ]
// for (let i = 0; i < book.length; i++) {
//     console.log(book[i])
// }


// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
// const height = 23
// const width = 10
// const s = height * width
// console.log(s)

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
// const heightC = 10
// const dC = 4
// const v = 3.14 * dC * heightC
// console.log(Math.floor(v))


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
// let n = 3 ** 2
// let m = 4 ** 2
// const k =  Math.sqrt(n + m)
// console.log(k)
